In [40]:
import pandas as pd

df = pd.read_csv('yearlyrecord.csv')

In [41]:
df

    Years   Branch  Performance
0    2012    Lagos         0.50
1    2012    Abuja         0.80
2    2012      Jos         0.60
3    2012  Plateau         0.74
4    2012     Abia         0.55
5    2012     Osun         0.60
6    2014    Lagos         0.80
7    2014    Abuja         0.76
8    2014      Jos         0.80
9    2014  Plateau         0.58
10   2014     Abia         0.75
11   2014     Osun         0.90
12   2016    Lagos         0.60
13   2016    Abuja         0.70
14   2016      Jos         0.80
15   2016  Plateau         0.85
16   2016     Abia         0.85
17   2016     Osun         0.85

In [81]:
group = df.groupby('Years')

In [82]:
df.Years.unique()

array([2012, 2014, 2016], dtype=int64)

In [83]:
for year in group:
    print('---------------------------')
    print(year)
    print('---------------------------')

---------------------------
(2012,    Years   Branch  Performance
0   2012    Lagos         0.50
1   2012    Abuja         0.80
2   2012      Jos         0.60
3   2012  Plateau         0.74
4   2012     Abia         0.55
5   2012     Osun         0.60)
---------------------------
---------------------------
(2014,     Years   Branch  Performance
6    2014    Lagos         0.80
7    2014    Abuja         0.76
8    2014      Jos         0.80
9    2014  Plateau         0.58
10   2014     Abia         0.75
11   2014     Osun         0.90)
---------------------------
---------------------------
(2016,     Years   Branch  Performance
12   2016    Lagos         0.60
13   2016    Abuja         0.70
14   2016      Jos         0.80
15   2016  Plateau         0.85
16   2016     Abia         0.85
17   2016     Osun         0.85)
---------------------------

In [45]:
group.get_group(2014)

    Years   Branch  Performance
6    2014    Lagos         0.80
7    2014    Abuja         0.76
8    2014      Jos         0.80
9    2014  Plateau         0.58
10   2014     Abia         0.75
11   2014     Osun         0.90

In [84]:
mean= group.mean()

In [85]:
mean

       Performance
Years
2012      0.631667
2014      0.765000
2016      0.775000

In [88]:
performance_mean = group.Performance.mean()

In [65]:
performance_mean

Years
2012    0.631667
2014    0.765000
2016    0.775000
Name: Performance, dtype: float64

In [66]:
performance_describe = group.Performance.describe()

In [67]:
performance_describe

       count      mean       std   min     25%    50%    75%   max
Years
2012     6.0  0.631667  0.114964  0.50  0.5625  0.600  0.705  0.80
2014     6.0  0.765000  0.105024  0.58  0.7525  0.780  0.800  0.90
2016     6.0  0.775000  0.103682  0.60  0.7250  0.825  0.850  0.85

In [75]:
performance = group.Performance.max()

In [76]:
performance

Years
2012    0.80
2014    0.90
2016    0.85
Name: Performance, dtype: float64